from tkinter import *
root = Tk()
root.title("Hawkeye")
Message(root, text="你看过河灯吗？它们被孩子们点燃，放入河中。"
"起初每一盏都燃着火，虽然只有豆大，但是蜡还多，所以豆大的火焰充满了向外膨胀的力量。每盏河灯各不相同，荷花盏，"
"纸船盏，火焰跃动的频率也各不同，好像每盏河灯都有它的个性似得。河灯连成一片，像是整个河面都要燃起来，这场面，"
"让你以为它们会一直随着河流漂到不可知的远处一样。然而很快就有河灯熄灭了，大概是一个小浪花末梢的小泡沫洇了它的焰心，"
"或者干脆是漏了水沉了底，但大多河灯还是燃着，继续漂流。慢慢得，河灯越来越少了，有些在某个转角处搁了浅，蜡烛一斜，把自己燃着了，"
"在岸边烧成了灰烬，有些被水草绊了跤，一翻身就再也没有起来，意外越来越多，河灯越来越少，那阵势，"
"从一大片发光的银河变成了黄昏的疏星。河灯就这样，流着流着，倏得少一只，再少一只。再到后面，就只剩下几盏河灯还在水里漂了，"
"周围是黑色的夜，黑色的水流，黑得分不清存不存在的世界。在无边际的黑色中，只剩下最后一两点米粒大的火光，它的同伴都熄灭了，"
"只有它还在燃烧。蜡燃到了根，火焰烫到了底座，再过一秒，最后的光也消失在漆黑的河面上，黑暗再也没有缺口，就像从来都没有一样。"
"点燃河灯的小孩早就睡觉了，河灯也永远不知道自己为什么要被点燃，它只是知道，既然已经烧起来，就要烧下去，结局早已经准备好了，"
"命运总是有祂的安排，祂的安排总是独到。",bg='blue', fg='ivory', relief=GROOVE).pack(padx=30, pady=30)
root.mainloop()